"""
Абстракция (abstraction) -      метод решения задачи, при котором объекты разного
                                рода объединяются общим понятием (концепцией), а затем сгруппированные сущности
                                рассматриваются как элементы единой категории.
Инкапсуляция (encapsulation) -  техника, при которой несущественная с точки
                                зрения интерфейса объекта информация прячется внутри него.
Наследование (inheritance) -    свойство объектов, посредством которого экземпляры
                                класса получают доступ к данным и методам классов-предков без их повторного
                                определения.
Полиморфизм (polymorphism) -    свойство, позволяющее использовать один и тот же
                                интерфейс для различных действий; полиморфной переменной, например,
                                может соответствовать несколько различных методов.
"""
